sdaiRenameSchemaInstanceBN(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*,Sdai_instS*,System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Renames a specified schema instance.
\param schemaInstOldName [in] A string that contains the old name of the schema instance to be renamed.
\param repository        [in] A repository where the function searches the schema instance by the specified name.
\param schemaInstName    [in] A new name of the schema instance.
\remarks
This function is not implemented yet.
Possible error codes:
* sdaiSS_NOPN - Session is not open.
* sdaiSI_DUP - Schema instance duplicate.
* sdaiSI_NEXS - Schema instance does not exist.
* sdaiRP_NOPN - Repository is not open.
* sdaiRP_NEXS - Repository does not exist.
* sdaiVT_NVLD - Name value type is invalid.
* sdaiTR_NAVL - Transaction currently not available.
* sdaiTR_EAB - Transaction ended abnormally.
* sdaiSY_ERR - Underlying system error.